---
title: SubTransaction
classe: Autodesk.Revit.DB.SubTransaction
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# SubTransaction

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `subTransaction.IsValidObject` | Boolean |
| `TransactionStatus Commit()` | `subTransaction.Commit()` | TransactionStatus |
| `Void Dispose()` | `subTransaction.Dispose()` | Void |
| `TransactionStatus GetStatus()` | `subTransaction.GetStatus()` | TransactionStatus |
| `Boolean HasEnded()` | `subTransaction.HasEnded()` | Boolean |
| `Boolean HasStarted()` | `subTransaction.HasStarted()` | Boolean |
| `TransactionStatus RollBack()` | `subTransaction.RollBack()` | TransactionStatus |
| `TransactionStatus Start()` | `subTransaction.Start()` | TransactionStatus |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```